Config/Catalogs/ПостоянноДействующиеКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПостоянноДействующиеКомиссии</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кворум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйПроцентЗа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьГолосПредседателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Временная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНеактуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвентаризационная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРабочейКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЧленаКомиссии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЧленовКомиссии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйИсполнитель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПредседатель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьУполномоченноеЛицо</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ДанныеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Звание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровССотрудниками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/СтатусыЧленовКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЧленовКомиссии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Председатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаместительПредседателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УполномоченноеПредседателемЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧленКомиссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Эксперт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаместительУполномоченногоПредседателемЛица</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/РешениеОПроведенииИнвентаризации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РешениеОПроведенииИнвентаризации</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПроведенияИнвентаризации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияПроведенияИнвентаризации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписиРуководитель</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписиОтветственный</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласующиеЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СогласующиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИнвентаризации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРабочейКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоИнвентаризации</Name>
							<Comment>Место проведения инвентаризации</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.МестоИнвентаризацииНФА</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комиссия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПостоянноДействующиеКомиссии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АктыОПроведенииИнвентаризации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛистСогласования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛистОзнакомления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СотрудникДляОзнакомления</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Catalogs/ПостоянноДействующиеКомиссии/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ДополнитьКодыЭлементовНулямиСлева");
	Методы.Вставить("ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию_2_0_102");
	Методы.Вставить("ОбработатьДанныеДляПереходаНаНовуюВерсию_2_0_102");
КонецПроцедуры

#КонецОбласти

Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	МассивРедактируемыхРеквизитов = Новый Массив;
	МассивРедактируемыхРеквизитов.Добавить("ДатаПриказа");
	
	Возврат МассивРедактируемыхРеквизитов;
	
КонецФункции

Функция ПолучитьДанныеКомиссии(Комиссия, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Комиссия", Комиссия);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставКомиссийОрганизаций.Ссылка.Владелец КАК Организация,
	|	(СоставКомиссийОрганизаций.СтатусЧленаКомиссии = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленовКомиссии.Председатель)) КАК Председатель,
	|	СоставКомиссийОрганизаций.Сотрудник КАК Сотрудник,
	|	СоставКомиссийОрганизаций.СтатусЧленаКомиссии КАК СтатусЧленаКомиссии,
	|	СоставКомиссийОрганизаций.ОтветственныйИсполнитель КАК ОтветственныйИсполнитель,
	|	СоставКомиссийОрганизаций.НомерСтроки КАК НомерСтроки,
	|	ФизическиеЛица.Ссылка КАК ФизическоеЛицо
	|ПОМЕСТИТЬ СоставКомиссии
	|ИЗ
	|	Справочник.ПостоянноДействующиеКомиссии.СоставКомиссии КАК СоставКомиссийОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|				ПО Контрагенты.ЮридическоеФизическоеЛицо = ФизическиеЛица.Ссылка
	|			ПО Сотрудники.Контрагент = Контрагенты.Ссылка
	|		ПО СоставКомиссийОрганизаций.Сотрудник = Сотрудники.Ссылка
	|ГДЕ
	|	СоставКомиссийОрганизаций.Ссылка = &Комиссия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
	|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ФИОФизЛиц
	|ИЗ
	|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних(
	|			&Период,
	|			ФизическоеЛицо В
	|				(ВЫБРАТЬ
	|					СоставКомиссии.ФизическоеЛицо
	|				ИЗ
	|					СоставКомиссии)) КАК ФИОФизическихЛицСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСотрудниковСрезПоследних.Подразделение КАК Подразделение,
	|	ДанныеСотрудниковСрезПоследних.Должность КАК Должность,
	|	ДанныеСотрудниковСрезПоследних.Звание КАК Звание,
	|	ДанныеСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ДанныеСотрудниковСрезПоследних.Организация КАК Организация
	|ПОМЕСТИТЬ ДанныеСотров
	|ИЗ
	|	РегистрСведений.ДанныеСотрудников.СрезПоследних(
	|			&Период,
	|			Организация В
	|					(ВЫБРАТЬ ПЕРВЫЕ 1
	|						СоставКомиссии.Организация
	|					ИЗ
	|						СоставКомиссии)
	|				И Сотрудник В
	|					(ВЫБРАТЬ
	|						СоставКомиссии.Сотрудник
	|					ИЗ
	|						СоставКомиссии)) КАК ДанныеСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставКомиссии.Сотрудник КАК Сотрудник,
	|	СоставКомиссии.Председатель КАК Председатель,
	|	СоставКомиссии.СтатусЧленаКомиссии КАК СтатусЧленаКомиссии,
	|	СоставКомиссии.ОтветственныйИсполнитель КАК ОтветственныйИсполнитель,
	|	ФИОФизическихЛицСрезПоследних.Фамилия КАК ФамилияЧленаКомиссии,
	|	ФИОФизическихЛицСрезПоследних.Имя КАК ИмяЧленаКомиссии,
	|	ФИОФизическихЛицСрезПоследних.Отчество КАК ОтчествоЧленаКомиссии,
	|	ДанныеСотрудниковСрезПоследних.Подразделение КАК ПодразделениеЧленаКомиссии,
	|	ДанныеСотрудниковСрезПоследних.Должность КАК ДолжностьЧленаКомиссии,
	|	ДанныеСотрудниковСрезПоследних.Звание КАК ЗваниеЧленаКомиссии
	|ИЗ
	|	СоставКомиссии КАК СоставКомиссии
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФИОФизЛиц КАК ФИОФизическихЛицСрезПоследних
	|		ПО СоставКомиссии.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеСотров КАК ДанныеСотрудниковСрезПоследних
	|		ПО СоставКомиссии.Сотрудник = ДанныеСотрудниковСрезПоследних.Сотрудник
	|			И СоставКомиссии.Организация = ДанныеСотрудниковСрезПоследних.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	СоставКомиссии.НомерСтроки";
	
	ТребуемыеДанные = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПоляЧленаКомиссии = "Сотрудник,ФамилияЧленаКомиссии,ИмяЧленаКомиссии,ОтчествоЧленаКомиссии,ДолжностьЧленаКомиссии,Председатель";
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура(ПоляЧленаКомиссии);
		ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
		ТребуемыеДанные.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	ИменаРеквизитов = "НаименованиеПриказа,НомерПриказа,ДатаПриказа,Кворум,МинимальныйПроцентЗа,УчитыватьГолосПредседателя";
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Комиссия, ИменаРеквизитов);
	Результат.Вставить("ДанныеКомиссии", ТребуемыеДанные);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьПередЗаписью(СправочникОбъект, Отказ = Неопределено) Экспорт
	
	ПроверитьНаличиеЧленовКомиссии(СправочникОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьСоответствиеСтатусовЧленаКомиссииВидуКомиссии(СправочникОбъект, Отказ);
	
	ПроверитьНаличиеДублейСотрудников(СправочникОбъект, Отказ);
	
	ПроверитьНаличиеПредседателяКомиссии(СправочникОбъект, Отказ);
	
	Если СправочникОбъект.Инвентаризационная Тогда
		ПроверитьНаличиеРабочихКомиссийБезУполномоченногоЛица(СправочникОбъект, Отказ);
		
		ПроверитьНаличиеЗаместителяПредседателяКомиссии(СправочникОбъект);
		
		ПроверитьНаличиеОтветственногоИсполнителяКомиссии(СправочникОбъект);
		
		ПроверитьКоличествоЧленовКомиссии(СправочникОбъект, Отказ);
		
		ПроверитьНаличиеЛицВнеРабочихКомиссий(СправочникОбъект, Отказ);
	Иначе
		Если Не ДопустимыРабочиеКомиссииВНеинвентаризационныхКомиссиях() Тогда
			ПроверитьНаличиеРабочихКомиссийВНеинвентаризационнойКомиссии(СправочникОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ДопустимыРабочиеКомиссииВНеинвентаризационныхКомиссиях() Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Для списка комиссий ищет рабочие комиссии без указания уполномоченного председателем лица.
//
// Параметры:
//	СписокКомиссий		- Массив			- список комиссий для проверки.
//	ТаблицаНомераСтрок	- ТаблицаЗначений	- возвращаемое значение, таблица с номерами строк табличной части для вывода сообщений.
//											см. функцию ПустаяТаблицаНомераСтрокРабочиеКомиссииБезУполномоченногоЛица()
Функция ЕстьРабочиеКомиссииБезУполномоченногоЛица(Знач СписокКомиссий, ТаблицаНомераСтрок = Неопределено) Экспорт
	
	ТаблицаНомераСтрок = ПустаяТаблицаНомераСтрокРабочиеКомиссииБезУполномоченногоЛица();
	
	ВыборкаГруппировкаКомиссия = ПрочитатьРабочиеКомиссииБезУполномоченногоЛица(СписокКомиссий);
	
	Пока ВыборкаГруппировкаКомиссия.Следующий() Цикл
		Выборка = ВыборкаГруппировкаКомиссия.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаНомераСтрок.Добавить();
			
			НоваяСтрока.Комиссия				= Выборка.Ссылка;
			НоваяСтрока.НомерРабочейКомиссии	= Выборка.НомерРабочейКомиссии;
			НоваяСтрока.НомерСтроки				= Выборка.МинимальныйНомерСтроки;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаНомераСтрок.Индексы.Добавить("Комиссия");
	
	Возврат ТаблицаНомераСтрок.Количество() > 0;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("НаименованиеПриказа");
	Результат.Добавить("ДатаПриказа");
	Результат.Добавить("НомерПриказа");
	Результат.Добавить("Кворум");
	Результат.Добавить("МинимальныйПроцентЗа");
	Результат.Добавить("УчитыватьГолосПредседателя");
	Результат.Добавить("Временная");
	Результат.Добавить("СоставКомиссии");
	Результат.Добавить("Инвентаризационная");
	
	Возврат Результат;  
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию_2_0_102(Параметры) Экспорт
	
	// Параллельный отложенный обработчик обновления.
	// Заполняет статусы членов комиссии и устанавливает флажок "Инвентаризационная" в справочнике "Комиссии".
	
	Запрос = Новый Запрос();
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПостоянноДействующиеКомиссии.СоставКомиссии
	|ГДЕ
	|	СтатусЧленаКомиссии = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленовКомиссии.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СправочникКомиссии.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПостоянноДействующиеКомиссии КАК СправочникКомиссии
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПостоянноДействующиеКомиссии.СоставКомиссии КАК ТЧСоставКомиссии
	|		ПО СправочникКомиссии.Ссылка = ТЧСоставКомиссии.Ссылка
	|		И НЕ СправочникКомиссии.Инвентаризационная
	|ГДЕ
	|	ТЧСоставКомиссии.НомерРабочейКомиссии > 0
	|СГРУППИРОВАТЬ ПО
	|	СправочникКомиссии.Ссылка
	|		
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТЧКомиссии.Комиссия
	|ИЗ
	|	Справочник.ПостоянноДействующиеКомиссии КАК СправочникКомиссии
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РешениеОПроведенииИнвентаризации.Комиссии КАК ТЧКомиссии
	|		ПО СправочникКомиссии.Ссылка = ТЧКомиссии.Комиссия
	|		И НЕ СправочникКомиссии.Инвентаризационная
	|	
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТЧКомиссии.Комиссия
	|ИЗ
	|	Справочник.ПостоянноДействующиеКомиссии КАК СправочникКомиссии
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеРешенияОПроведенииИнвентаризации.Комиссии КАК ТЧКомиссии
	|		ПО СправочникКомиссии.Ссылка = ТЧКомиссии.Комиссия
	|		И НЕ СправочникКомиссии.Инвентаризационная
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТЧКомиссии.КомиссияДоИзменения
	|ИЗ
	|	Справочник.ПостоянноДействующиеКомиссии КАК СправочникКомиссии
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеРешенияОПроведенииИнвентаризации.Комиссии КАК ТЧКомиссии
	|		ПО СправочникКомиссии.Ссылка = ТЧКомиссии.КомиссияДоИзменения
	|		И НЕ СправочникКомиссии.Инвентаризационная";
	
	Данные = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Данные);	
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию_2_0_102(Параметры) Экспорт
	
	Перем Статистика;
	
	// Параллельный отложенный обработчик обновления.
	// Заполняет статусы членов комиссии и устанавливает флажок "Инвентаризационная" в справочнике "Комиссии".
	
	МетаданныеОбъекта = Метаданные.Справочники.ПостоянноДействующиеКомиссии;
	
	ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляОбработки();
	ДополнительныеПараметры.ИмяВременнойТаблицы = "ВТДляОбработки";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Результат = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуСсылокДляОбработки(Параметры.Очередь,
		ПолноеИмяОбъекта, МенеджерВременныхТаблиц, ДополнительныеПараметры);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Список комиссий для обработки.
	|//
	|ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	ВТДляОбработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Комиссии, в которых требуется установка флажка Инвентаризационная.
	|//
	|ВЫБРАТЬ
	|	ВТДляОбработки.Ссылка КАК Ссылка
	|ИЗ
	|	ВТДляОбработки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПостоянноДействующиеКомиссии.СоставКомиссии КАК ТЧСоставКомиссии
	|		ПО ВТДляОбработки.Ссылка = ТЧСоставКомиссии.Ссылка
	|ГДЕ
	|	ТЧСоставКомиссии.НомерРабочейКомиссии > 0
	|СГРУППИРОВАТЬ ПО
	|	ВТДляОбработки.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТДляОбработки.Ссылка КАК Ссылка
	|ИЗ
	|	ВТДляОбработки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РешениеОПроведенииИнвентаризации.Комиссии КАК ТЧКомиссии
	|		ПО ВТДляОбработки.Ссылка = ТЧКомиссии.Комиссия
	|	
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТДляОбработки.Ссылка КАК Ссылка
	|ИЗ
	|	ВТДляОбработки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеРешенияОПроведенииИнвентаризации.Комиссии КАК ТЧКомиссии
	|		ПО ВТДляОбработки.Ссылка = ТЧКомиссии.Комиссия
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТДляОбработки.Ссылка КАК Ссылка
	|ИЗ
	|	ВТДляОбработки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеРешенияОПроведенииИнвентаризации.Комиссии КАК ТЧКомиссии
	|		ПО ВТДляОбработки.Ссылка = ТЧКомиссии.КомиссияДоИзменения";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	// [0]. Список комиссий для обработки.
	Выборка = РезультатыЗапроса[0].Выбрать();
	
	// [1]. Комиссии, в которых требуется установка флажка Инвентаризационная.
	ВыборкаФлажокИнвентаризационная = РезультатыЗапроса[1].Выбрать();
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	Если Выборка.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = Истина;
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru='Обработчик обновления завершил обработку объектов %1'"),
			ПолноеИмяОбъекта);
			
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			,
			,
			ТекстСообщения);
			
		Возврат;
	КонецЕсли;
	
	Статистика = Новый Структура();
	Статистика.Вставить("ВозниклаОшибка", Ложь);
	Статистика.Вставить("ОбъектовОбработано", 0);
	Статистика.Вставить("ПлохиеДанные", Новый Соответствие());
	
	ПоискСсылки = Новый Структура("Ссылка");
	
	НачатьТранзакцию();
	
	Попытка
		Пока Выборка.Следующий() Цикл
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Блокировка.Заблокировать();
			
			ПоискСсылки.Ссылка = Выборка.Ссылка;
			ВыборкаФлажокИнвентаризационная.Сбросить();
			ЗначениеФлажкаИнвентаризационная = ВыборкаФлажокИнвентаризационная.НайтиСледующий(ПоискСсылки);
			
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			// Если объект ранее был удален, пропускаем его.
			Если СправочникОбъект = Неопределено Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
				
				Статистика.ОбъектовОбработано = Статистика.ОбъектовОбработано + 1;
				
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеФлажкаИнвентаризационная Тогда
				СправочникОбъект.Инвентаризационная = ЗначениеФлажкаИнвентаризационная;
			КонецЕсли;
			
			Для Каждого СтрокаТаблицы Из СправочникОбъект.СоставКомиссии Цикл
				Если СтрокаТаблицы.УдалитьПредседатель Тогда
					СтатусЧленаКомиссии = Перечисления.СтатусыЧленовКомиссии.Председатель;
					
				ИначеЕсли СтрокаТаблицы.УдалитьУполномоченноеЛицо Тогда
					СтатусЧленаКомиссии = Перечисления.СтатусыЧленовКомиссии.УполномоченноеПредседателемЛицо;
					
				Иначе
					СтатусЧленаКомиссии = Перечисления.СтатусыЧленовКомиссии.ЧленКомиссии;
				КонецЕсли;
				
				СтрокаТаблицы.СтатусЧленаКомиссии = СтатусЧленаКомиссии;
			КонецЦикла;
			
			Если СправочникОбъект.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			КонецЕсли;

			Статистика.ОбъектовОбработано = Статистика.ОбъектовОбработано + 1;			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Если Статистика.ОбъектовОбработано > 0 Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru='Успешно обработаны элементы справочника %1: %2 шт.'"),
				МетаданныеОбъекта.ПолноеИмя(),
				Статистика.ОбъектовОбработано);
				
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Информация,
				МетаданныеОбъекта,
				,
				ТекстСообщения);
		КонецЕсли;
	Исключение
		ОтменитьТранзакцию();
		
		Статистика.ВозниклаОшибка = Истина;
		
		ТекстСообщения = СтрШаблон(НСтр("ru='Не удалось записать элемент справочника %1 по причине %2'"),
			МетаданныеОбъекта.ПолноеИмя(),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,
			МетаданныеОбъекта,
			Выборка.Ссылка,
			ТекстСообщения);
	КонецПопытки;
	
	Для Каждого НеобработанныйОбъект Из Статистика.ПлохиеДанные Цикл
		ОбновлениеИнформационнойБазы.ЗарегистрироватьПроблемуСДанными(НеобработанныйОбъект.Ключ, НеобработанныйОбъект.Значение);
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

Процедура ДополнитьКодыЭлементовНулямиСлева() Экспорт
	
	// Монопольный обработчик обновления 2.0.107.
	// Дополняет коды элементов символами "0" слева до длины кода 9 символов из-за увеличения длины кода справочника.
	
	МетаданныеОбъекта = Метаданные.Справочники.ПостоянноДействующиеКомиссии;
	
	ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
	ЦелеваяДлинаКода = МетаданныеОбъекта.ДлинаКода;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПостоянноДействующиеКомиссии.Ссылка КАК Ссылка,
	|	ПостоянноДействующиеКомиссии.Код КАК Код
	|ИЗ
	|	Справочник.ПостоянноДействующиеКомиссии КАК ПостоянноДействующиеКомиссии
	|ГДЕ
	|	(ВЫРАЗИТЬ(ПРАВ(ПостоянноДействующиеКомиссии.Код, 1) КАК СТРОКА(1))) = "" """;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПроблемныхОбъектов = 0;
	ОбъектовОбработано = 0;
	
	Если Выборка.Количество() = 0 Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru='Отсутствуют элементы справочника %1, требующие дополнения длины кода элементов слева до %2 символов.'"),
			ПолноеИмяОбъекта,
			ЦелеваяДлинаКода);
			
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			,
			,
			ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		Пока Выборка.Следующий() Цикл
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			// Если объект ранее был удален, пропускаем его.
			Если СправочникОбъект = Неопределено Тогда
				ОбъектовОбработано = ОбъектовОбработано + 1;
				
				Продолжить;
			КонецЕсли;
			
			КодЭлемента = СокрЛП(СправочникОбъект.Код);
			
			// Если элемент уже был обработан ранее, пропускаем его.
			Если СтрДлина(КодЭлемента) = ЦелеваяДлинаКода Тогда
				ОбъектовОбработано = ОбъектовОбработано + 1;
				
				Продолжить;
			КонецЕсли;
			
			СправочникОбъект.Код = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(КодЭлемента, ЦелеваяДлинаКода);
			
			Если СправочникОбъект.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
			КонецЕсли;
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
		
		ТекстСообщения = СтрШаблон(НСтр("ru='Не удалось записать элемент справочника %1 (код %2) по причине %3.'"),
			ПолноеИмяОбъекта,
			Выборка.Код,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,
			МетаданныеОбъекта,
			Выборка.Ссылка,
			ТекстСообщения);
	КонецПопытки;
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru='Не удалось обработать некоторые элементы справочника %1 (пропущены): %2 шт.'"),
			МетаданныеОбъекта.ПолноеИмя(),
			ПроблемныхОбъектов);
			
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ТекстСообщения = СтрШаблон(
		НСтр("ru='Успешно завершено дополнение нулями слева до длины %1 символов кодов элемента справочника %2. Обработано элементов: %3 шт.'"),
		ЦелеваяДлинаКода,
		ПолноеИмяОбъекта,
		ОбъектовОбработано);
		
	ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,
		МетаданныеОбъекта,
		,
		ТекстСообщения);
	
	ОбновитьНумерациюОбъектов(МетаданныеОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПустаяТаблицаНомераСтрокРабочиеКомиссииБезУполномоченногоЛица()
	
	ТаблицаНомераСтрок = Новый ТаблицаЗначений();
	ТаблицаНомераСтрок.Колонки.Добавить("Комиссия",				Новый ОписаниеТипов("СправочникСсылка.ПостоянноДействующиеКомиссии"));
	ТаблицаНомераСтрок.Колонки.Добавить("НомерРабочейКомиссии",	ОбщегоНазначения.ОписаниеТипаЧисло(6,0,ДопустимыйЗнак.Неотрицательный));
	ТаблицаНомераСтрок.Колонки.Добавить("НомерСтроки",			ОбщегоНазначения.ОписаниеТипаЧисло(6,0,ДопустимыйЗнак.Неотрицательный));
	
	Возврат ТаблицаНомераСтрок;
	
КонецФункции

Процедура ПроверитьНаличиеЧленовКомиссии(Знач СправочникОбъект, ЕстьОшибкиЗаполнения)
	
	Если СправочникОбъект.СоставКомиссии.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОшибкиЗаполнения = Истина;
	
	ОбщегоНазначения.СообщитьПользователю(ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список", "Заполнение",,, СправочникОбъект.Метаданные().ТабличныеЧасти.СоставКомиссии.Синоним),
		СправочникОбъект.Ссылка,
		"Объект.СоставКомиссии");
	
КонецПроцедуры

Процедура ПроверитьСоответствиеСтатусовЧленаКомиссииВидуКомиссии(Знач СправочникОбъект, ЕстьОшибкиЗаполнения = Неопределено)
	
	Если СправочникОбъект.Инвентаризационная Тогда
		МассивСтатусов = Перечисления.СтатусыЧленовКомиссии.ПолучитьСтатусыИнвентаризационнойКомиссии();
		
		ТекстДляКакойКомиссии = НСтр("ru='инвентаризационной'");
	Иначе
		МассивСтатусов = Перечисления.СтатусыЧленовКомиссии.ПолучитьСтатусыНеИнвентаризационнойКомиссии();
		
		ТекстДляКакойКомиссии = НСтр("ru='не инвентаризационной'");
	КонецЕсли;
	
	ТекстШаблон = НСтр("ru='Для %1 комиссии не предполагается указание статуса члена комиссии %2'");
	
	Для Каждого СтрокаТаблицы Из СправочникОбъект.СоставКомиссии Цикл
		СтатусЧленаКомиссии = СтрокаТаблицы.СтатусЧленаКомиссии;
		
		Если Не ЗначениеЗаполнено(СтатусЧленаКомиссии) Тогда
			Продолжить;
		КонецЕсли;
		
		Если МассивСтатусов.Найти(СтатусЧленаКомиссии) = Неопределено Тогда
			ЕстьОшибкиЗаполнения = Истина;
			
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстШаблон, ТекстДляКакойКомиссии, СтатусЧленаКомиссии),
				СправочникОбъект.Ссылка,
				"Объект." + ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставКомиссии", СтрокаТаблицы.НомерСтроки, "СтатусЧленаКомиссии"));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНаличиеРабочихКомиссийБезУполномоченногоЛица(Знач СправочникОбъект, ЕстьОшибкиЗаполнения = Неопределено)
	
	ТаблицаНомераСтрок = НайтиРабочиеКомиссииБезУполномоченногоЛица(СправочникОбъект);
	
	Если ТаблицаНомераСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОшибкиЗаполнения = Истина;
	
	ТекстШаблон = НСтр("ru='Для рабочей инвентаризационной комиссии ""%1"" не задано уполномоченное председателем лицо.'");
	
	Для Каждого СтрокаТаблицы Из ТаблицаНомераСтрок Цикл
		ТекстСообщения = СтрШаблон(ТекстШаблон,
			ИнвентаризацияКлиентСервер.ФорматироватьНомерРабочейКомиссии(СтрокаТаблицы.НомерРабочейКомиссии));
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			СправочникОбъект.Ссылка,
			"Объект." + ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставКомиссии", СтрокаТаблицы.НомерСтроки, "НомерРабочейКомиссии"));
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНаличиеПредседателяКомиссии(Знач СправочникОбъект, ЕстьОшибкиЗаполнения = Неопределено)
	
	Поиск = Новый Структура("СтатусЧленаКомиссии", Перечисления.СтатусыЧленовКомиссии.Председатель);
	
	ВремТаблица = СправочникОбъект.СоставКомиссии.Выгрузить(Поиск);
	
	Если ВремТаблица.Количество() = 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если ВремТаблица.Количество() = 0 Тогда
		ЕстьОшибкиЗаполнения = Истина;
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Для комиссии не задан председатель комиссии.'"),
			СправочникОбъект.Ссылка,
			"Объект.СоставКомиссии");
			
	ИначеЕсли ВремТаблица.Количество() > 1 Тогда
		ЕстьОшибкиЗаполнения = Истина;
		
		НомерСтроки = ВремТаблица[ВремТаблица.Количество() - 1].НомерСтроки;
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Для комиссии задано более одного председателя комиссии.'"),
			СправочникОбъект.Ссылка,
			"Объект." + ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставКомиссии", НомерСтроки, "СтатусЧленаКомиссии"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаличиеЗаместителяПредседателяКомиссии(Знач СправочникОбъект, ЕстьОшибкиЗаполнения = Неопределено)
	
	ТекстСправочно = ?(ЕстьОшибкиЗаполнения = Неопределено, НСтр("ru='Справочно: '"), "");
	
	Поиск = Новый Структура("СтатусЧленаКомиссии", Перечисления.СтатусыЧленовКомиссии.ЗаместительПредседателя);
	
	ВремТаблица = СправочникОбъект.СоставКомиссии.Выгрузить(Поиск);
	
	Если ВремТаблица.Количество() = 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если ВремТаблица.Количество() = 0 Тогда
		ЕстьОшибкиЗаполнения = Истина;
		
		ТекстСообщения = СтрШаблон(НСтр("ru='%1Для комиссии не задан заместитель председателя комиссии.'"), ТекстСправочно);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			СправочникОбъект.Ссылка,
			"Объект.СоставКомиссии");
			
	ИначеЕсли ВремТаблица.Количество() > 1 Тогда
		ЕстьОшибкиЗаполнения = Истина;
		
		НомерСтроки = ВремТаблица[ВремТаблица.Количество() - 1].НомерСтроки;
		
		ТекстСообщения = СтрШаблон(НСтр("ru='%1Для комиссии задано более одного заместителя председателя комиссии.'"), ТекстСправочно);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			СправочникОбъект.Ссылка,
			"Объект." + ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставКомиссии", НомерСтроки, "СтатусЧленаКомиссии"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаличиеОтветственногоИсполнителяКомиссии(Знач СправочникОбъект, ЕстьОшибкиЗаполнения = Неопределено)
	
	ТекстСправочно = ?(ЕстьОшибкиЗаполнения = Неопределено, НСтр("ru='Справочно: '"), "");
	
	Поиск = Новый Структура("ОтветственныйИсполнитель", Истина);
	
	ВремТаблица = СправочникОбъект.СоставКомиссии.Выгрузить(Поиск);
	
	Если ВремТаблица.Количество() = 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если ВремТаблица.Количество() = 0 Тогда
		ЕстьОшибкиЗаполнения = Истина;
		
		ТекстСообщения = СтрШаблон(НСтр("ru='%1Для комиссии не задан ответственный исполнитель.'"), ТекстСправочно);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			СправочникОбъект.Ссылка,
			"Объект.СоставКомиссии");
			
	ИначеЕсли ВремТаблица.Количество() > 1 Тогда
		НомерСтроки = ВремТаблица[ВремТаблица.Количество() - 1].НомерСтроки;
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Справочно: Для комиссии задано более одного ответственного исполнителя.'"),
			СправочникОбъект.Ссылка,
			"Объект." + ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставКомиссии", НомерСтроки, "ОтветственныйИсполнитель"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьКоличествоЧленовКомиссии(Знач СправочникОбъект, ЕстьОшибкиЗаполнения = Неопределено)
	
	// Пункт 4 приказа Минфина от 30 декабря 2017 г. N 274н
	// II. Организация проведения инвентаризации
	// Руководитель субъекта учета утверждает состав комиссии, состоящий не менее чем из трех человек.
	
	ТекстСправочно = ?(ЕстьОшибкиЗаполнения = Неопределено, НСтр("ru='Справочно: '"), "");
	
	Если СправочникОбъект.СоставКомиссии.Количество() >= 3 Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОшибкиЗаполнения = Истина;
	
	ТекстСообщения = СтрШаблон(НСтр("ru='%1В инвентаризационной комиссии менее трех человек.'"), ТекстСправочно);
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
		СправочникОбъект.Ссылка,
		"Объект.СоставКомиссии");
	
КонецПроцедуры

Процедура ПроверитьНаличиеРабочихКомиссийВНеинвентаризационнойКомиссии(Знач СправочникОбъект, ЕстьОшибкиЗаполнения = Неопределено)
	
	ТекстСправочно = ?(ЕстьОшибкиЗаполнения = Неопределено, НСтр("ru='Справочно: '"), "");
	
	Если СправочникОбъект.Инвентаризационная Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из СправочникОбъект.СоставКомиссии Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.НомерРабочейКомиссии) Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибкиЗаполнения = Истина;
		
		ТекстСообщения = СтрШаблон(НСтр("ru='%1Рабочие комиссии предусмотрены только для инвентаризационных комиссий.'"), ТекстСправочно);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
			СправочникОбъект.Ссылка,
			"Объект." + ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставКомиссии", СтрокаТаблицы.НомерСтроки, "НомерРабочейКомиссии"));
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПроверитьНаличиеЛицВнеРабочихКомиссий(Знач СправочникОбъект, ЕстьОшибкиЗаполнения = Неопределено)
	
	ТекстСправочно = ?(ЕстьОшибкиЗаполнения = Неопределено, НСтр("ru='Справочно: '"), "");
	
	Для Каждого СтрокаТаблицы Из СправочникОбъект.СоставКомиссии Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.НомерРабочейКомиссии) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы.СтатусЧленаКомиссии = Перечисления.СтатусыЧленовКомиссии.УполномоченноеПредседателемЛицо Тогда
			ЕстьОшибкиЗаполнения = Истина;
			
			ТекстСообщения = СтрШаблон(НСтр("ru='%1Уполномоченное председателем лицо может указываться только в рабочей комиссии.'"), ТекстСправочно);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
				СправочникОбъект.Ссылка,
				"Объект." + ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставКомиссии", СтрокаТаблицы.НомерСтроки, "СтатусЧленаКомиссии"));
			
		ИначеЕсли СтрокаТаблицы.СтатусЧленаКомиссии = Перечисления.СтатусыЧленовКомиссии.ЗаместительУполномоченногоПредседателемЛица Тогда
			ЕстьОшибкиЗаполнения = Истина;
			
			ТекстСообщения = СтрШаблон(НСтр("ru='%1Заместитель уполномоченного председателем лица может указываться только в рабочей комиссии.'"), ТекстСправочно);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
				СправочникОбъект.Ссылка,
				"Объект." + ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставКомиссии", СтрокаТаблицы.НомерСтроки, "СтатусЧленаКомиссии"));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНаличиеДублейСотрудников(Знач СправочникОбъект, ЕстьОшибкиЗаполнения = Неопределено)
	
	ТаблицаДублиСтрок = ОбщегоНазначенияБГУ.НайтиДублиСтрок(СправочникОбъект.СоставКомиссии.Выгрузить(), "Сотрудник");
	
	Если ТаблицаДублиСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОшибкиЗаполнения = Истина;
	
	ПараметрыВывода = ОбщегоНазначенияБГУ.ПараметрыВыводаСообщенийОДубляхСтрок();
	ПараметрыВывода.ТаблицаИмя					= "СоставКомиссии";
	ПараметрыВывода.ТаблицаПредставление		= СправочникОбъект.Метаданные().ТабличныеЧасти.СоставКомиссии.Синоним;
	ПараметрыВывода.ОбъектСсылка				= СправочникОбъект.Ссылка;
	ПараметрыВывода.ШаблонСтроки				= НСтр("ru='Обнаружены дубли сотрудников в составе комиссии (таблица ""[ТаблицаПредставление]"", строки [НомераСтрок])'");
	ПараметрыВывода.ИмяПоляДляВыводаСообщений	= "Сотрудник";
	
	ОбщегоНазначенияБГУ.ВывестиСообщенияОДубляхСтрок(ТаблицаДублиСтрок, ПараметрыВывода);
	
КонецПроцедуры

Функция НайтиРабочиеКомиссииБезУполномоченногоЛица(Знач СправочникОбъект)
	
	// Допустимое заполнение - в рабочей комиссии состоит Председатель или Уполномоченное председателем лицо.
	
	ПервыеСтрокиРабочихКомиссий = Новый Соответствие();
	КорректныеРабочиеКомиссии = Новый Соответствие();
	
	Для Каждого СтрокаТаблицы Из СправочникОбъект.СоставКомиссии Цикл
		НомерРабочейКомиссии = СтрокаТаблицы.НомерРабочейКомиссии;
		
		Если Не ЗначениеЗаполнено(НомерРабочейКомиссии) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПервыеСтрокиРабочихКомиссий.Получить(НомерРабочейКомиссии) = Неопределено Тогда
			ПервыеСтрокиРабочихКомиссий.Вставить(НомерРабочейКомиссии, СтрокаТаблицы.НомерСтроки);
		КонецЕсли;
		
		Если СтрокаТаблицы.СтатусЧленаКомиссии = Перечисления.СтатусыЧленовКомиссии.Председатель
			Или СтрокаТаблицы.СтатусЧленаКомиссии = Перечисления.СтатусыЧленовКомиссии.УполномоченноеПредседателемЛицо Тогда
			КорректныеРабочиеКомиссии.Вставить(НомерРабочейКомиссии, Истина);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаНомераСтрок = ПустаяТаблицаНомераСтрокРабочиеКомиссииБезУполномоченногоЛица();
	
	Для Каждого Элемент Из ПервыеСтрокиРабочихКомиссий Цикл
		НомерРабочейКомиссии = Элемент.Ключ;
		
		Если КорректныеРабочиеКомиссии.Получить(НомерРабочейКомиссии) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаНомераСтрок.Добавить();
		НоваяСтрока.Комиссия				= СправочникОбъект.Ссылка;
		НоваяСтрока.НомерРабочейКомиссии	= НомерРабочейКомиссии;
		НоваяСтрока.НомерСтроки				= ПервыеСтрокиРабочихКомиссий.Получить(НомерРабочейКомиссии);
	КонецЦикла;
	
	Возврат ТаблицаНомераСтрок;
	
КонецФункции

Функция ПрочитатьРабочиеКомиссииБезУполномоченногоЛица(Знач СписокКомиссий)
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("СписокКомиссий", СписокКомиссий);
	ЗапросПоиск.Текст = "
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	НомерРабочейКомиссии		КАК НомерРабочейКомиссии,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА СтатусЧленаКомиссии = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленовКомиссии.УполномоченноеПредседателемЛицо) ТОГДА
	|			ИСТИНА
	|		КОГДА СтатусЧленаКомиссии = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленовКомиссии.Председатель) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ)						КАК ЕстьУполномоченноеПредседателемЛицо,
	|	МИНИМУМ(НомерСтроки)		КАК МинимальныйНомерСтроки
	|ИЗ
	|	Справочник.ПостоянноДействующиеКомиссии.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	Ссылка В(&СписокКомиссий)
	|	И НомерРабочейКомиссии > 0
	|СГРУППИРОВАТЬ ПО
	|	Ссылка,
	|	НомерРабочейКомиссии
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА СтатусЧленаКомиссии = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленовКомиссии.УполномоченноеПредседателемЛицо) ТОГДА
	|			ИСТИНА
	|		КОГДА СтатусЧленаКомиссии = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленовКомиссии.Председатель) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ) = ЛОЖЬ
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерРабочейКомиссии
	|ИТОГИ ПО
	|	Ссылка";
	
	УстановитьПривилегированныйРежим(Истина);
	ВыборкаГруппировкаКомиссия = ЗапросПоиск.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ВыборкаГруппировкаКомиссия;
	
КонецФункции

#КонецОбласти

#КонецЕсли
